<a href="https://colab.research.google.com/github/Jeongyoon-Jang/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_5(7%EC%9B%9427%EC%9D%BC).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd

In [6]:
from collections import OrderedDict
friend_list = [
               ['name',['John', 'Jenny', 'Nate']],
               ['age',[20,30,30]],
               ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))

In [7]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [8]:
df[1:3] #파이썬처럼 마지막 인덱스는 포함하지 않음

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [9]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [10]:
df = df[1:3]

In [11]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [13]:
friend_list = [
               ['name',['John', 'Jenny', 'Nate']],
               ['age',[20,30,30]],
               ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [14]:
df.loc[[0,2]] #0번째 행과 2번째 행이 출력됨

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [15]:
df = df.loc[[0,2]] # 0번째 행과 2번째 행으로 이루어진 데이터프레임

In [16]:
df

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [17]:
friend_list = [
               ['name',['John', 'Jenny', 'Nate']],
               ['age',[20,30,30]],
               ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [18]:
# by column condition

In [19]:
df[df.age > 25] #데이터프레임 중 age라는 속성이 25세 이상인 정보

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [20]:
df.query('age>25') # age가 25보다 큰 것들 불러오기

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [21]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [22]:
df[(df.age>25) & (df.name == 'Nate')] #25세보다 크고 이름이 Nate인 사람 불러오기

   name  age      job
2  Nate   30  teacher

In [25]:
# filter column

In [24]:
# by index

In [27]:
friend_list = [
               ['John', 20, 'student'],
               ['Jenny', 30, 'developer'],
               ['Nate', 30, 'teacher']
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [28]:
df.iloc[:,0:2] # 0,1번 column만 보여줌(앞부분 : 는 행)

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [29]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

In [30]:
# by column name

In [32]:
df = pd.read_csv('friend_list_no_head.csv', header = None, names=['name','age','job'])

In [33]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [34]:
df_filtered = df[['name', 'age']] # name, age만 불러옴(filter out함)

In [35]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [36]:
df.filter(items=['age','job']) #age와 job만 나옴

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [37]:
df.filter(like='a', axis=1) #column의 이름에서 a가 들어가는 열만 불러옴

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [38]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [40]:
df.filter(regex='b$', axis=1) # regex 이용해서 문자가 b로 끝나는 열 불러옴

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern